Repository: Mwende-Kyalo/Doc-oclock
Catalog: lib/l10n/app_*.arb
Languages: sw

# welcomeToApp
source: Welcome to Telemedicine App
sw: Karibu kwenye Programu ya Tiba ya Mbali

source: Sign in as Patient
sw: Ingia kama Mgonjwa

source: Sign up as Patient
sw: Jisajili kama Mgonjwa

source: Sign in as Doctor
sw: Ingia kama Daktari

source: Settings
sw: Mipangilio

source: Account Details
sw: Maelezo ya Akaunti

source: Usability Settings
sw: Mipangilio ya Matumizi

source: Account Actions
sw: Vitendo vya Akaunti

source: Dark Mode
sw: Hali ya Giza

source: Font Size
sw: Ukubwa wa Herufi

source: Language
sw: Lugha

source: Select Language
sw: Chagua Lugha

source: English
sw: Kiingereza

source: Swahili
sw: Kiswahili

source: Full Name
sw: Jina Kamili

source: Email
sw: Barua Pepe

source: Phone Number
sw: Nambari ya Simu

source: Password
sw: Nenosiri

source: Confirm Password
sw: Thibitisha Nenosiri

source: Edit
sw: Hariri

source: Save
sw: Hifadhi

source: Cancel
sw: Ghairi

source: Logout
sw: Toka

# areYouSureLogout
source: Are you sure you want to logout?
sw: Je, una uhakika unataka kutoka?

source: Profile updated successfully
sw: Wasifu umehifadhiwa kwa mafanikio

source: Failed to update profile
sw: Kushindwa kuhifadhi wasifu

# pleaseEnterFullName
source: Please enter your full name
sw: Tafadhali ingiza jina lako kamili

# pleaseEnterEmail
source: Please enter your email
sw: Tafadhali ingiza barua pepe yako

# pleaseEnterValidEmail
source: Please enter a valid email
sw: Tafadhali ingiza barua pepe halali

# pleaseEnterPhoneNumber
source: Please enter your phone number
sw: Tafadhali ingiza nambari yako ya simu

# pleaseEnterPassword
source: Please enter your password
sw: Tafadhali ingiza nenosiri lako

# passwordTooShort
source: Password must be at least 6 characters
sw: Nenosiri lazima liwe na angalau herufi 6

source: Passwords do not match
sw: Nenosiri hazifanani

source: Book Appointment
sw: Andaa Miadi

source: Appointments
sw: Miadi

source: View EHR
sw: Angalia Rekodi za Kimatibabu

source: Messages
sw: Ujumbe

source: Prescriptions
sw: Dawa Zilizoagizwa

source: Medicine Info
sw: Taarifa za Dawa

source: Payment
sw: Malipo

source: Payment History
sw: Historia ya Malipo

source: Make Payment
sw: Lipa

source: History
sw: Historia

source: Sign In
sw: Ingia

source: Sign Up
sw: Jisajili

source: Doctor Sign In
sw: Daktari Ingia

source: Dashboard
sw: Dashibodi

source: Calendar
sw: Kalenda

# doctorAppointments
source: View Appointments
sw: Angalia Miadi

# doctorEhr
source: View EHR
sw: Angalia Rekodi za Kimatibabu

# doctorPayments
source: Payments
sw: Malipo

# doctorHistory
source: History
sw: Historia

source: Patient Details
sw: Maelezo ya Mgonjwa

source: Add EHR
sw: Ongeza Rekodi za Kimatibabu

# alreadyHaveAccount
source: Already have an account? Sign in
sw: Tayari una akaunti? Ingia

# dontHaveAccount
source: Don't have an account? Sign up
sw: Huna akaunti? Jisajili

# areYouADoctor
source: Are you a doctor? Sign in here
sw: Je, wewe ni daktari? Ingia hapa

source: Book Now
sw: Andaa Sasa

source: Confirm
sw: Thibitisha

source: Delete
sw: Futa

source: Retry
sw: Jaribu tena

source: Error
sw: Kosa

# noAvailability
source: No availability at the moment
sw: Hakuna nafasi kwa sasa

source: Time
sw: Muda

source: Consultation Type
sw: Aina ya Mkutano

source: Voice
sw: Sauti

source: Confirm Appointment
sw: Thibitisha Miadi

source: Payment Options
sw: Chaguzi za Malipo

source: Pay Later
sw: Lipa Baadaye

source: Pay Now
sw: Lipa Sasa

# payViaMpesa
source: Pay via M-Pesa mobile money
sw: Lipa kwa kutumia M-Pesa

source: Card
sw: Kadi

# payViaCard
source: Pay via debit/credit card
sw: Lipa kwa kutumia kadi ya benki

# noPaymentsYet
source: No payments have been made yet
sw: Bado hakuna malipo yaliyofanywa

source: Back to Appointments
sw: Rudi kwenye Miadi

source: Payment failed
sw: Malipo yameshindwa

source: Payment successful!
sw: Malipo yamefanikiwa!

# pleaseEnterValidPhone
source: Please enter a valid phone number
sw: Tafadhali ingiza nambari ya simu halali

# pleaseFillCardDetails
source: Please fill all card details
sw: Tafadhali jaza maelezo yote ya kadi

# fetchingInfo
source: Fetching medicine information...
sw: Inapopata taarifa za dawa...

source: No results found
sw: Hakuna matokeo yaliyopatikana

# enterMedicineName
source: Enter a medicine name to get detailed information
sw: Ingiza jina la dawa kupata taarifa za kina

# includingSideEffects
source: Including side effects, contraindications, and special instructions
sw: Pamoja na madhara, vizuizi, na maelekezo maalum

source: Loading...
sw: Inapakia...

source: Searching...
sw: Inatafuta...

source: Get Medicine Info
sw: Pata Taarifa za Dawa

source: Type a message...
sw: Andika ujumbe...

source: Send
sw: Tuma

source: Past Appointments
sw: Miadi Iliyopita

source: Past Calls
sw: Simu Zilizopita

# noAppointments
source: No appointments found
sw: Hakuna miadi iliyopatikana

# noCalls
source: No calls found
sw: Hakuna simu zilizopatikana

source: Welcome
sw: Karibu

source: Doctor
sw: Daktari

source: Patient
sw: Mgonjwa

source: Date
sw: Tarehe

source: Status
sw: Hali

source: Fee
sw: Ada

source: Diagnosis
sw: Ugunduzi

source: Notes
sw: Maelezo

source: Prescription
sw: Agizo la Dawa

source: Search
sw: Tafuta

source: Filter
sw: Chuja

source: All
sw: Zote

source: Pending
sw: Inasubiri

source: Completed
sw: Imekamilika

source: Cancelled
sw: Imeghairiwa

source: Past
sw: Iliyopita

source: Booked
sw: Imeahidiwa

source: Rescheduled
sw: Imeahirishwa

source: Select Date
sw: Chagua Tarehe

source: Select Time
sw: Chagua Muda

source: Doctor Name
sw: Jina la Daktari

source: Specialization
sw: Maalum

source: Rating
sw: Kiwango

source: Bio
sw: Wasifu

source: Available Slots
sw: Nafasi Zinazopatikana

source: Book Appointments
sw: Andaa Miadi

source: Order Prescriptions
sw: Agiza Dawa

source: Upcoming Appointments
sw: Miadi Inayokuja

source: Patient EHRs
sw: Rekodi za Wagonjwa

source: User
sw: Mtumiaji

source: Sign in failed
sw: Kuingia kumeshindwa

source: Sign up failed
sw: Kujisajili kumeshindwa

# donthaveAccount
source: Don't have an account? Sign up
sw: Huna akaunti? Jisajili

# pleaseConfirmPassword
source: Please confirm your password
sw: Tafadhali thibitisha nenosiri lako

# passwordMustBeAtLeast6
source: Password must be at least 6 characters
sw: Nenosiri lazima liwe na angalau herufi 6

# note
source: Note: Doctors can only sign in with provided credentials.
sw: Kumbuka: Madaktari wanaweza kuingia tu kwa maelezo yaliyotolewa.

# testConnection
source: Test Connection to Supabase
sw: Jaribu Muunganisho kwa Supabase

source: Enter OTP
sw: Ingiza OTP

source: Verify
sw: Thibitisha

source: Resend OTP
sw: Tuma tena OTP

source: Forgot Password?
sw: Umesahau Nenosiri?

source: Back to Sign In
sw: Rudi kwenye Kuingia

source: Create Account
sw: Unda Akaunti

source: Booking failed
sw: Kuahidi miadi kumeshindwa

source: Available Dates & Times
sw: Tarehe na Muda Unaopatikana

source: Book Appointment with
sw: Andaa Miadi na

# pleaseConfirmDetails
source: Please confirm your appointment details:
sw: Tafadhali thibitisha maelezo ya miadi yako:

# appointmentBookedSuccessfully
source: Your appointment has been booked successfully! Would you like to pay now or pay later?
sw: Miadi yako imeahidiwa kwa mafanikio! Ungependa kulipa sasa au baadaye?

source: Video Call
sw: Simu ya Video

source: Voice Call
sw: Simu ya Sauti

source: Consultation Fee
sw: Ada ya Mkutano

source: Search Medicine Information
sw: Tafuta Taarifa za Dawa

source: Enter medicine name(s)
sw: Ingiza jina la dawa

# medicineNameHint
source: e.g., Paracetamol, Aspirin, Ibuprofen
sw: mfano, Paracetamol, Aspirin, Ibuprofen

source: General Information
sw: Taarifa za Jumla

source: Side Effects
sw: Madhara

# contraindications
source: Contraindications (When NOT to Take)
sw: Vizuizi (Wakati usiotakiwa kutumia)

source: Special Instructions
sw: Maelekezo Maalum

# noReviews
source: reviews
sw: maoni

source: reviews
sw: maoni

source: Submit
sw: Wasilisha

source: Rate Doctor
sw: Kadiria Daktari

# writeReview
source: Write a Review
sw: Andika Ukaguzi

source: Your Rating
sw: Kadirio Lako

# reviewText
source: Review
sw: Ukaguzi

source: Submit Review
sw: Wasilisha Ukaguzi

source: Thank You
sw: Asante

# reviewSubmitted
source: Your review has been submitted successfully
sw: Ukaguzi wako umeandikishwa kwa mafanikio

source: No reviews yet
sw: Bado hakuna ukaguzi

source: Average Rating
sw: Kadirio la Wastani

source: Total Reviews
sw: Jumla ya Ukaguzi

source: Patient Reviews
sw: Ukaguzi wa Wagonjwa

source: View All Reviews
sw: Angalia Ukaguzi Wote

source: My Reviews
sw: Ukaguzi Wangu

source: Edit Review
sw: Hariri Ukaguzi

source: Delete Review
sw: Futa Ukaguzi

# areYouSureDeleteReview
source: Are you sure you want to delete this review?
sw: Je, una uhakika unataka kufuta ukaguzi huu?

# reviewDeleted
source: Review deleted successfully
sw: Ukaguzi umeufutwa kwa mafanikio

source: Update Review
sw: Sasisha Ukaguzi

# reviewUpdated
source: Review updated successfully
sw: Ukaguzi umeusasishwa kwa mafanikio

# pleaseSelectRating
source: Please select a rating
sw: Tafadhali chagua kadirio

# pleaseWriteReview
source: Please write a review
sw: Tafadhali andika ukaguzi

# reviewTextPlaceholder
source: Share your experience with this doctor...
sw: Shiriki uzoefu wako na daktari huyu...

source: Rate Service
sw: Kadiria Huduma

source: Anonymous
sw: Anonimous

source: Verified Patient
sw: Mgonjwa Aliyethibitishwa

source: Payments
sw: Malipo

# noPaymentsMadeYet
source: No payments have been made yet
sw: Bado hakuna malipo yaliyofanywa

source: Transaction ID
sw: Kitambulisho cha Muamala

source: Payment Already Made
sw: Malipo Yamefanywa Tayari

# thisAppointmentPaid
source: This appointment has already been paid for.
sw: Miadi hii imelipwa tayari.

source: No Unpaid Appointments
sw: Hakuna Miadi Isiyolipwa

# allAppointmentsPaid
source: All your appointments have been paid for.
sw: Miadi yako yote imelipwa.

source: Appointment Details
sw: Maelezo ya Miadi

source: Select Payment Method
sw: Chagua Njia ya Malipo

source: Card Payment
sw: Malipo ya Kadi

source: Proceed to Payment
sw: Endelea kwenye Malipo

source: Not Paid
sw: Haijalipwa

source: Medicine Information
sw: Taarifa za Dawa

# pleaseEnterAtLeastOneMedicine
source: Please enter at least one medicine name
sw: Tafadhali ingiza angalau jina moja la dawa

# errorFetchingMedicineInfo
source: Error fetching medicine information
sw: Kosa katika kupata taarifa za dawa

source: Error fetching information
sw: Kosa katika kupata taarifa

# unableToFetchInfo
source: Unable to fetch information
sw: Haiwezekani kupata taarifa

source: No chats yet
sw: Bado hakuna mazungumzo

# startConversation
source: Start a conversation with a doctor
sw: Anza mazungumzo na daktari

source: Online
sw: Mtandaoni

source: Offline
sw: Nje ya mtandao

source: Today
sw: Leo

source: Yesterday
sw: Jana

source: Initiate Video Call
sw: Anza Simu ya Video

source: Initiate Voice Call
sw: Anza Simu ya Sauti

source: No messages yet
sw: Bado hakuna ujumbe

# startChatting
source: Start chatting with your doctor
sw: Anza kuzungumza na daktari wako

source: Appointment not found
sw: Miadi haijapatikana

# noPastAppointments
source: No past appointments found
sw: Hakuna miadi iliyopita iliyopatikana

# noPastCalls
source: No past calls found
sw: Hakuna simu zilizopita zilizopatikana

# pastAppointmentsWillAppearHere
source: Your past appointments will appear here
sw: Miadi yako iliyopita itaonekana hapa

# pastCallsWillAppearHere
source: Your past video and voice calls will appear here
sw: Simu zako za video na sauti zilizopita zitaonekana hapa

source: View Details
sw: Angalia Maelezo

source: Consultation Method
sw: Njia ya Mkutano

source: Paid
sw: Imelipwa

source: Start Video Call
sw: Anza Simu ya Video

# viewPatientHistory
source: View Patient History (EHR)
sw: Angalia Historia ya Mgonjwa (Rekodi za Kimatibabu)

source: Edit Appointment Details
sw: Hariri Maelezo ya Miadi

# paymentRequired
source: Payment is required before you can attend the consultation.
sw: Malipo yanahitajika kabla ya kuhudhuria mkutano.

source: M-Pesa Payment
sw: Malipo ya M-Pesa

source: Amount
sw: Kiasi

source: M-Pesa Phone Number
sw: Nambari ya Simu ya M-Pesa

# youWillReceiveMpesaPrompt
source: You will receive an M-Pesa prompt to enter your PIN.
sw: Utapokea onyo la M-Pesa ili uingize PIN yako.

source: Card Number
sw: Nambari ya Kadi

source: Expiry
sw: Mwisho wa Muda

source: Card Holder Name
sw: Jina la Mmiliki wa Kadi

source: Processing Payment...
sw: Inachakata Malipo...

# pleaseCheckPhoneForMpesa
source: Please check your phone for M-Pesa prompt
sw: Tafadhali angalia simu yako kwa onyo la M-Pesa

source: Payment request failed
sw: Ombi la malipo limeshindwa

source: Failed
sw: Imeshindwa

# yourPaymentHistoryWillAppear
source: Your payment history will appear here
sw: Historia yako ya malipo itaonekana hapa

source: Pay Consultation Fee
sw: Lipa Ada ya Mkutano

# youWillReceivePrompt
source: You will receive an M-Pesa prompt to enter your PIN.
sw: Utapokea onyo la M-Pesa ili uingize PIN yako.

# searchingMedicineInfo
source: Searching medicine information...
sw: Inatafuta taarifa za dawa...

# loadingMedicineInfo
source: Loading medicine information...
sw: Inapakia taarifa za dawa...

# enterMedicineNameForInfo
source: Enter a medicine name to get detailed information
sw: Ingiza jina la dawa kupata taarifa za kina

# errorFetchingInfo
source: Error fetching information
sw: Kosa katika kupata taarifa

source: Clear
sw: Futa

# emptyStateNoMedicines
source: Enter a medicine name to get detailed information
sw: Ingiza jina la dawa kupata taarifa za kina

# emptyStateMedicinesSubtext
source: Including side effects, contraindications, and special instructions
sw: Pamoja na madhara, vizuizi, na maelekezo maalum

# startConversationWithDoctor
source: Start a conversation with a doctor
sw: Anza mazungumzo na daktari

# startChattingWithDoctor
source: Start chatting with your doctor
sw: Anza kuzungumza na daktari wako

source: Chat with Doctor
sw: Zungumza na Daktari

source: New Message
sw: Ujumbe Mpya

source: Online Status
sw: Hali ya Mtandaoni

source: Last Seen
sw: Mwisho Kuonekana

source: Typing...
sw: Inaandika...

# readReceipt
source: Read
sw: Imesomwa

# deliveredReceipt
source: Delivered
sw: Imeletwa

source: Send Message
sw: Tuma Ujumbe

source: Message sent
sw: Ujumbe umetumwa

# messageFailed
source: Message failed to send
sw: Ujumbe haukufanikiwa kutuma

# videoCallTitle
source: Video Call
sw: Simu ya Video

# voiceCallTitle
source: Voice Call
sw: Simu ya Sauti

source: End Call
sw: Maliza Simu

source: Mute
sw: Zima Sauti

source: Unmute
sw: Washa Sauti

source: Turn Camera On
sw: Washa Kamera

source: Turn Camera Off
sw: Zima Kamera

source: Switch Camera
sw: Badilisha Kamera

# callConnecting
source: Connecting...
sw: Inaunganisha...

# callRinging
source: Ringing...
sw: Inapiga...

source: Call Ended
sw: Simu Imemalizika

source: Call Duration
sw: Muda wa Simu

source: Call Failed
sw: Simu Imeshindwa

source: Add Availability
sw: Ongeza Nafasi

source: Remove Availability
sw: Ondoa Nafasi

source: Available Dates
sw: Tarehe Zinazopatikana

source: Add Date
sw: Ongeza Tarehe

source: Select Availability Date
sw: Chagua Tarehe ya Nafasi

source: Start Time
sw: Muda wa Mwanzo

source: End Time
sw: Muda wa Mwisho

# availabilityAdded
source: Availability added successfully
sw: Nafasi imeongezwa kwa mafanikio

# availabilityRemoved
source: Availability removed successfully
sw: Nafasi imeondolewa kwa mafanikio

source: EHR Records
sw: Rekodi za Kimatibabu

# noEhrRecords
source: No EHR records found
sw: Hakuna rekodi za matibabu zilizopatikana

source: Add EHR Record
sw: Ongeza Rekodi za Kimatibabu

source: Edit EHR Record
sw: Hariri Rekodi za Kimatibabu

# diagnosisLabel
source: Diagnosis
sw: Ugunduzi

# prescriptionLabel
source: Prescription
sw: Agizo la Dawa

# notesLabel
source: Notes
sw: Maelezo

# recordSaved
source: Record saved successfully
sw: Rekodi imehifadhiwa kwa mafanikio

# recordDeleted
source: Record deleted successfully
sw: Rekodi imefutwa kwa mafanikio

source: Failed to save record
sw: Kushindwa kuhifadhi rekodi

source: Delete Record
sw: Futa Rekodi

# areYouSureDeleteRecord
source: Are you sure you want to delete this record?
sw: Je, una uhakika unataka kufuta rekodi hii?

source: Add Prescription
sw: Ongeza Agizo la Dawa

source: Prescription Mode
sw: Hali ya Agizo la Dawa

source: Medication Name
sw: Jina la Dawa

source: Dosage
sw: Kiwango

source: Frequency
sw: Mara Ngapi

source: Duration
sw: Muda

source: Add Medication
sw: Ongeza Dawa

source: Remove Medication
sw: Ondoa Dawa

source: Patient Name
sw: Jina la Mgonjwa

source: Patient Email
sw: Barua Pepe ya Mgonjwa

source: Patient Phone
sw: Simu ya Mgonjwa

source: Contact Patient
sw: Wasiliana na Mgonjwa

source: View EHR Records
sw: Angalia Rekodi za Kimatibabu

source: Add New EHR Record
sw: Ongeza Rekodi Mpya ya Kimatibabu

# appointmentDateAndTime
source: Date & Time
sw: Tarehe na Muda

source: View All Appointments
sw: Angalia Miadi Yote

# todayAppointments
source: Today's Appointments
sw: Miadi ya Leo

source: No upcoming appointments
sw: Hakuna miadi inayokuja

# noTodayAppointments
source: No appointments today
sw: Hakuna miadi leo

source: Accept Appointment
sw: Kubali Miadi

source: Reject Appointment
sw: Kataa Miadi

source: Mark as Completed
sw: Weka kama Imekamilika

source: Cancel Appointment
sw: Ghairi Miadi

source: Appointment accepted
sw: Miadi imekubaliwa

source: Appointment rejected
sw: Miadi imekataliwa

source: Appointment cancelled
sw: Miadi imeghairiwa

# appointmentCompleted
source: Appointment marked as completed
sw: Miadi imewekwa kama imekamilika

source: No appointments available
sw: Hakuna miadi inayopatikana

source: Doctor Dashboard
sw: Dashibodi ya Daktari

source: Patient Dashboard
sw: Dashibodi ya Mgonjwa

source: Welcome Back
sw: Karibu Tena

source: Recent Activity
sw: Shughuli za Hivi Karibuni

source: Quick Actions
sw: Vitendo vya Haraka

source: Order Prescription
sw: Agiza Dawa

source: View Prescriptions
sw: Angalia Dawa Zilizoagizwa

# prescriptionOrdered
source: Prescription ordered successfully
sw: Dawa imeagizwa kwa mafanikio

source: Prescription Details
sw: Maelezo ya Dawa

source: Ordered
sw: Imeagizwa

source: Not Ordered
sw: Haijaagizwa

source: Mark as Ordered
sw: Weka kama Imeagizwa

# prescriptionMarkedOrdered
source: Prescription marked as ordered
sw: Dawa imewekwa kama imeagizwa

# forgotPasswordTitle
source: Forgot Password
sw: Umesahau Nenosiri

# resetPasswordInstructions
source: Enter your email address and we'll send you instructions to reset your password.
sw: Ingiza anwani yako ya barua pepe na tutakutumia maelekezo ya kurekebisha nenosiri lako.

source: Send Reset Link
sw: Tuma Kiungo cha Kurekebisha

# resetLinkSent
source: Reset link sent to your email
sw: Kiungo cha kurekebisha kimetumwa kwenye barua pepe yako

# enterEmailForReset
source: Please enter your email address
sw: Tafadhali ingiza anwani yako ya barua pepe

# otpVerificationTitle
source: OTP Verification
sw: Uthibitishaji wa OTP

# enterOtpSentToEmail
source: Enter the OTP sent to your email
sw: Ingiza OTP iliyotumwa kwenye barua pepe yako

# otpVerified
source: OTP verified successfully
sw: OTP imethibitishwa kwa mafanikio

source: OTP verification failed
sw: Uthibitishaji wa OTP umeshindwa

# invalidOtp
source: Invalid OTP. Please try again.
sw: OTP si sahihi. Tafadhali jaribu tena.

source: Resend OTP in
sw: Tuma tena OTP ndani ya

source: seconds
sw: sekunde

source: Resend OTP Now
sw: Tuma tena OTP Sasa

source: My Appointments
sw: Miadi Yangu

source: Delete Appointment
sw: Futa Miadi

# areYouSureDeleteAppointment
source: Are you sure you want to delete this appointment? This action cannot be undone.
sw: Je, una uhakika unataka kufuta miadi hii? Kitendo hiki hakiwezi kutenguliwa.

source: Select New Date
sw: Chagua Tarehe Mpya

source: Select New Time
sw: Chagua Muda Mpya

# appointmentDeleted
source: Appointment deleted successfully
sw: Miadi imefutwa kwa mafanikio

# appointmentRescheduled
source: Appointment rescheduled successfully
sw: Miadi imeahirishwa kwa mafanikio

source: Failed to delete appointment
sw: Kushindwa kufuta miadi

source: Failed to reschedule appointment
sw: Kushindwa kuahirisha miadi

source: Reschedule
sw: Ahirisha

source: My Prescriptions
sw: Dawa Zangu Zilizoagizwa

source: No prescriptions found
sw: Hakuna dawa zilizoagizwa zilizopatikana

# prescriptionsFromDoctors
source: Prescriptions from doctors will appear here
sw: Dawa zilizoagizwa na madaktari zitaonekana hapa

source: Medications
sw: Dawa

source: Instructions
sw: Maelekezo

source: Medical Records (EHR)
sw: Rekodi za Kimatibabu (EHR)

source: No medical records found
sw: Hakuna rekodi za matibabu zilizopatikana

# myAppointmentsTitle
source: My Appointments
sw: Miadi Yangu

# appointmentType
source: Type
sw: Aina

# doctorLabel
source: Doctor
sw: Daktari

# dateLabel
source: Date
sw: Tarehe

# timeLabel
source: Time
sw: Muda

source: Your Availability
sw: Nafasi Zako

source: No availability added yet
sw: Bado hakuna nafasi iliyoongezwa

source: From
sw: Kutoka

source: to
sw: hadi

# pleaseSelectDateStartTimeEndTime
source: Please select date, start time, and end time
sw: Tafadhali chagua tarehe, muda wa mwanzo, na muda wa mwisho

source: End time must be after start time
sw: Muda wa mwisho lazima uwe baada ya muda wa mwanzo

source: Failed to load availabilities
sw: Kushindwa kupakia nafasi

source: Availability deleted
sw: Nafasi imefutwa

source: Failed to delete availability
sw: Kushindwa kufuta nafasi

# areYouSureDeleteAvailability
source: Are you sure you want to delete this availability? This will not affect already booked appointments.
sw: Je, una uhakika unataka kufuta nafasi hii? Hii haitaathiri miadi iliyoahidiwa tayari.

source: No patients found
sw: Hakuna wagonjwa waliopatikana

# emailLabel
source: Email
sw: Barua Pepe

# phoneLabel
source: Phone
sw: Simu

source: Update Record
sw: Sasisha Rekodi

source: Save Record
sw: Hifadhi Rekodi

source: Prescription Summary
sw: Muhtasari wa Agizo la Dawa

source: Additional prescription notes
sw: Maelezo ya ziada ya agizo la dawa

source: Please enter diagnosis
sw: Tafadhali ingiza ugunduzi

source: Please enter prescription
sw: Tafadhali ingiza agizo la dawa

source: Please add at least one medication
sw: Tafadhali ongeza angalau dawa moja

# pleaseFillAllMedicationFields
source: Please fill in all medication fields
sw: Tafadhali jaza sehemu zote za dawa

# recordUpdatedSuccessfully
source: Record updated successfully! Changes will be visible to the patient.
sw: Rekodi imesasishwa kwa mafanikio! Mabadiliko yataonekana kwa mgonjwa.

source: Please enter OTP
sw: Tafadhali ingiza OTP

source: OTP must be 6 digits
sw: OTP lazima iwe na tarakimu 6

# invalidOtpError
source: Invalid OTP
sw: OTP si sahihi

source: Reset Password
sw: Rekebisha Nenosiri

source: Server error
sw: Kosa la seva

source: Enter your email
sw: Ingiza barua pepe yako

# enterValidEmail
source: Enter a valid email
sw: Ingiza barua pepe halali

source: Enter new password
sw: Ingiza nenosiri jipya

source: Confirm New Password
sw: Thibitisha Nenosiri Jipya

source: Confirm your password
sw: Thibitisha nenosiri lako

source: Reset failed
sw: Kurekebisha kumeshindwa

source: Invalid doctor credentials
sw: Maelezo ya daktari si sahihi

# doctorAccountsCreatedByAdministrators
source: Note: Doctor accounts are created by administrators
sw: Kumbuka: Akaunti za madaktari zinaundwa na wasimamizi

source: Are you a patient? Patient sign in
sw: Je, wewe ni mgonjwa? Mgonjwa ingia

source: Connected
sw: Imeunganishwa

source: Video On
sw: Video Imezimwa

source: Video Off
sw: Video Imesimamishwa

source: Earpiece
sw: Kisikio
