Repository: Mwende-Kyalo/Doc-oclock
Catalog: lib/l10n/app_*.arb
Languages: sw

source: OK
sw: Sawa

source: Incoming call
sw: Simu inayoingia

source: Outgoing call
sw: Simu inayotoka

source: Welcome, {user}!
sw: Karibu, {user}!

source: Medical Records
sw: Rekodi za Kimatibabu

source: Profile
sw: Wasifu

source: Security
sw: Usalama

# twoFactorAuthentication
source: Two-Factor Authentication (2FA)
sw: Uthibitishaji wa Sababu Mbili (2FA)

# twoFactorEnabled
source: Enabled - Your account is protected with 2FA
sw: Imeamilishwa - Akaunti yako imelindwa na 2FA

# twoFactorDisabled
source: Disabled - Add an extra layer of security
sw: Imezimwa - Ongeza safu ya ziada ya usalama

source: Enable Two-Factor Authentication
sw: Amilisha Uthibitishaji wa Sababu Mbili

source: Disable Two-Factor Authentication
sw: Zima Uthibitishaji wa Sababu Mbili

# twoFactorEnabledSuccessfully
source: Two-Factor Authentication enabled successfully
sw: Uthibitishaji wa Sababu Mbili umeamilishwa kwa mafanikio

# twoFactorDisabledSuccessfully
source: Two-Factor Authentication disabled
sw: Uthibitishaji wa Sababu Mbili umezimwa

# disable2FAConfirmation
source: Are you sure you want to disable 2FA? This will make your account less secure.
sw: Je, una uhakika unataka kuzima 2FA? Hii itafanya akaunti yako iwe na usalama mdogo.

# enable2FAInstructions
source: You will receive a verification code via email. Please enter the code to complete the setup.
sw: Utapokea msimbo wa uthibitishaji kupitia barua pepe. Tafadhali ingiza msimbo ili kukamilisha usanidi.

source: Verify Email Code
sw: Thibitisha Msimbo wa Barua Pepe

# enterVerificationCode
source: Please enter the verification code sent to your email:
sw: Tafadhali ingiza msimbo wa uthibitishaji uliotumwa kwenye barua pepe yako:

source: Verification Code
sw: Msimbo wa Uthibitishaji

# continueButton
source: Continue
sw: Endelea

source: Disable
sw: Zima

source: No prescriptions available
sw: Hakuna dawa zilizoagizwa zinazopatikana
